status/2022/0916.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-17 Sat 07:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>10 September 2022 - 16 September 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">10 September 2022 - 16 September 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc54aafa">1. MIT OCW</a>
<ul>
<li><a href="#org6c74b48">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orgebc27cd">1.1.1. Session 88-91</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgef244d3">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#org8827607">2.1. Finished desoldering switch</a></li>
<li><a href="#org377951c">2.2. Radio constructed</a></li>
<li><a href="#orgca27246">2.3. Need to test</a></li>
</ul>
</li>
<li><a href="#orgcbeb1cf">3. Mill Controller #2</a>
<ul>
<li><a href="#org9bdbe77">3.1. Repurpose 'boss' hard drive</a></li>
<li><a href="#org65a77ec">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#orgadad25e">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org9485867">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org204a3d1">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org2947bfc">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#orgd64ac85">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#orgb6a423c">5. OLPC</a>
<ul>
<li><a href="#orgffee078">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org5fb712b">6. Virtual Orchestra</a>
<ul>
<li><a href="#orgd7156c9">6.1. sfz file tests</a>
<ul>
<li><a href="#orge104c70">6.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org4c1158f">6.2. increasingly skeptical whether quality results are possible</a></li>
</ul>
</li>
<li><a href="#orga324968">7. gat</a>
<ul>
<li><a href="#orgeb38d9a">7.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org73d43a3">8. abby</a>
<ul>
<li><a href="#orgb4c4059">8.1. installed three wire chassis fan - too noisy</a></li>
<li><a href="#orgd6aa863">8.2. have another 3 wire fan from DET which may be less noisy</a></li>
<li><a href="#orgd41826e">8.3. need to get 4 wire chassis fan</a></li>
</ul>
</li>
<li><a href="#orga6d8d4e">9. marble computing</a>
<ul>
<li><a href="#org4ecbc87">9.1. Programmable Marble Gate Array</a>
<ul>
<li><a href="#orgeeb1a88">9.1.1. Logic table to operation 'compiler' done</a></li>
<li><a href="#org0015221">9.1.2. Nucleo-f303re controller IO done enough for servos</a></li>
<li><a href="#org74f178b">9.1.3. Waiting for servos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgccfe2d8">10. small graphics display</a>
<ul>
<li><a href="#org07009ce">10.1. Use 320x480 OLED display and ESP8266+WiFi</a></li>
<li><a href="#orga3c9293">10.2. VT340+Regis graphics (Abandoned)</a></li>
<li><a href="#orga78bdb4">10.3. Direct btmap interface</a></li>
</ul>
</li>
<li><a href="#org029479f">11. mcd05 32 button/led box</a>
<ul>
<li><a href="#orga1c6721">11.1. Recovered schematics.</a></li>
<li><a href="#org663e6db">11.2. Planning software.</a></li>
</ul>
</li>
<li><a href="#org1b94943">12. ca-r</a></li>
<li><a href="#org407572c">13. More project ideas</a>
<ul>
<li><a href="#org847520f">13.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#orgf51e333">13.2. GMPForth ports to SIMH</a>
<ul>
<li><a href="#orgba66383">13.2.1. SIMH maybe some targets (vax)</a></li>
<li><a href="#orgdb3bc5f">13.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org47da93a">13.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org4d39222">13.3. GMPASM assembler</a></li>
<li><a href="#org5606013">13.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org9d360fe">13.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#org9c5ec50">13.5.1. Offline compilation</a></li>
<li><a href="#orge1dd0ca">13.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org2d08092">13.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org346dae6">13.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#org4e6964a">13.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#orge481258">13.6.3. CPUs with async bus may be supportable without RAM</a></li>
<li><a href="#org92474bd">13.6.4. Use Nucleo w/ 5V tolerant IO as boot loader controller</a></li>
</ul>
</li>
<li><a href="#org5520750">13.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org25f33ce">13.7.1. OSI Superboard</a></li>
<li><a href="#org497c448">13.7.2. Super Jolt</a></li>
<li><a href="#orgc266c17">13.7.3. Ampro Little Board</a></li>
<li><a href="#org2dc2d73">13.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#org951f5c3">13.7.5. Etc.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgadad15f">14. David Davies</a>
<ul>
<li><a href="#orgc685eff">14.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgfe2c875">14.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org8ae736c">14.3. Next hearing 9/20/2022</a></li>
</ul>
</li>
<li><a href="#orgf82f0d0">15. Peter Kim</a>
<ul>
<li><a href="#orgb5c2a1b">15.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org15fd9b2">15.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#orgc214290">15.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#org1b4c73f">15.4. Sentencing 9/20/2022</a></li>
<li><a href="#org1ef992b">15.5. See Also</a></li>
</ul>
</li>
<li><a href="#org1cbda5c">16. Reading</a>
<ul>
<li><a href="#org5cccb1d">16.1. A New History of Modern Computing (Thomas Haigh and Paul E. Ceruzzi)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc54aafa" class="outline-2">
<h2 id="orgc54aafa"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6c74b48" class="outline-3">
<h3 id="org6c74b48"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgebc27cd" class="outline-4">
<h4 id="orgebc27cd"><span class="section-number-4">1.1.1.</span> Session 88-91</h4>
</div>
</div>
</div>
<div id="outline-container-orgef244d3" class="outline-2">
<h2 id="orgef244d3"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8827607" class="outline-3">
<h3 id="org8827607"><span class="section-number-3">2.1.</span> Finished desoldering switch</h3>
</div>
<div id="outline-container-org377951c" class="outline-3">
<h3 id="org377951c"><span class="section-number-3">2.2.</span> Radio constructed</h3>
</div>
<div id="outline-container-orgca27246" class="outline-3">
<h3 id="orgca27246"><span class="section-number-3">2.3.</span> Need to test</h3>
</div>
</div>
<div id="outline-container-orgcbeb1cf" class="outline-2">
<h2 id="orgcbeb1cf"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9bdbe77" class="outline-3">
<h3 id="org9bdbe77"><span class="section-number-3">3.1.</span> Repurpose 'boss' hard drive</h3>
</div>
<div id="outline-container-org65a77ec" class="outline-3">
<h3 id="org65a77ec"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgadad25e" class="outline-4">
<h4 id="orgadad25e"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org9485867" class="outline-4">
<h4 id="org9485867"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org204a3d1" class="outline-2">
<h2 id="org204a3d1"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2947bfc" class="outline-3">
<h3 id="org2947bfc"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-orgd64ac85" class="outline-3">
<h3 id="orgd64ac85"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-orgb6a423c" class="outline-2">
<h2 id="orgb6a423c"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgffee078" class="outline-3">
<h3 id="orgffee078"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org5fb712b" class="outline-2">
<h2 id="org5fb712b"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd7156c9" class="outline-3">
<h3 id="orgd7156c9"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orge104c70" class="outline-4">
<h4 id="orge104c70"><span class="section-number-4">6.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org4c1158f" class="outline-3">
<h3 id="org4c1158f"><span class="section-number-3">6.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
</div>
<div id="outline-container-orga324968" class="outline-2">
<h2 id="orga324968"><span class="section-number-2">7.</span> gat</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgeb38d9a" class="outline-3">
<h3 id="orgeb38d9a"><span class="section-number-3">7.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org73d43a3" class="outline-2">
<h2 id="org73d43a3"><span class="section-number-2">8.</span> abby</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgb4c4059" class="outline-3">
<h3 id="orgb4c4059"><span class="section-number-3">8.1.</span> installed three wire chassis fan - too noisy</h3>
</div>
<div id="outline-container-orgd6aa863" class="outline-3">
<h3 id="orgd6aa863"><span class="section-number-3">8.2.</span> have another 3 wire fan from DET which may be less noisy</h3>
</div>
<div id="outline-container-orgd41826e" class="outline-3">
<h3 id="orgd41826e"><span class="section-number-3">8.3.</span> need to get 4 wire chassis fan</h3>
</div>
</div>
<div id="outline-container-orga6d8d4e" class="outline-2">
<h2 id="orga6d8d4e"><span class="section-number-2">9.</span> marble computing</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org4ecbc87" class="outline-3">
<h3 id="org4ecbc87"><span class="section-number-3">9.1.</span> Programmable Marble Gate Array</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgeeb1a88" class="outline-4">
<h4 id="orgeeb1a88"><span class="section-number-4">9.1.1.</span> Logic table to operation 'compiler' done</h4>
</div>
<div id="outline-container-org0015221" class="outline-4">
<h4 id="org0015221"><span class="section-number-4">9.1.2.</span> Nucleo-f303re controller IO done enough for servos</h4>
</div>
<div id="outline-container-org74f178b" class="outline-4">
<h4 id="org74f178b"><span class="section-number-4">9.1.3.</span> Waiting for servos</h4>
</div>
</div>
</div>
<div id="outline-container-orgccfe2d8" class="outline-2">
<h2 id="orgccfe2d8"><span class="section-number-2">10.</span> small graphics display</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org07009ce" class="outline-3">
<h3 id="org07009ce"><span class="section-number-3">10.1.</span> Use 320x480 OLED display and ESP8266+WiFi</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Can write to display
</p>
</div>
</div>
<div id="outline-container-orga3c9293" class="outline-3">
<h3 id="orga3c9293"><span class="section-number-3">10.2.</span> VT340+Regis graphics (Abandoned)</h3>
<div class="outline-text-3" id="text-10-2">
<p>
OLED display cannot hardware scroll in required direction
</p>
</div>
</div>
<div id="outline-container-orga78bdb4" class="outline-3">
<h3 id="orga78bdb4"><span class="section-number-3">10.3.</span> Direct btmap interface</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Cannot find suitable existing image format for memory
constrained receiver, so constructing a new format.
</p>
</div>
</div>
</div>
<div id="outline-container-org029479f" class="outline-2">
<h2 id="org029479f"><span class="section-number-2">11.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orga1c6721" class="outline-3">
<h3 id="orga1c6721"><span class="section-number-3">11.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-org663e6db" class="outline-3">
<h3 id="org663e6db"><span class="section-number-3">11.2.</span> Planning software.</h3>
</div>
</div>
<div id="outline-container-org1b94943" class="outline-2">
<h2 id="org1b94943"><span class="section-number-2">12.</span> ca-r</h2>
<div class="outline-text-2" id="text-12">
<p>
<a href="https://github.com/daniel-kelley/ca-r/issues/34">https://github.com/daniel-kelley/ca-r/issues/34</a>
Another ancient stalled project trying to be completed.
</p>
</div>
</div>
<div id="outline-container-org407572c" class="outline-2">
<h2 id="org407572c"><span class="section-number-2">13.</span> More project ideas</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org847520f" class="outline-3">
<h3 id="org847520f"><span class="section-number-3">13.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-orgf51e333" class="outline-3">
<h3 id="orgf51e333"><span class="section-number-3">13.2.</span> GMPForth ports to SIMH</h3>
<div class="outline-text-3" id="text-13-2">
</div>
<div id="outline-container-orgba66383" class="outline-4">
<h4 id="orgba66383"><span class="section-number-4">13.2.1.</span> SIMH maybe some targets (vax)</h4>
</div>
<div id="outline-container-orgdb3bc5f" class="outline-4">
<h4 id="orgdb3bc5f"><span class="section-number-4">13.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-13-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-org47da93a" class="outline-4">
<h4 id="org47da93a"><span class="section-number-4">13.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org4d39222" class="outline-3">
<h3 id="org4d39222"><span class="section-number-3">13.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-13-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-org5606013" class="outline-3">
<h3 id="org5606013"><span class="section-number-3">13.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org9d360fe" class="outline-3">
<h3 id="org9d360fe"><span class="section-number-3">13.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-13-5">
</div>
<div id="outline-container-org9c5ec50" class="outline-4">
<h4 id="org9c5ec50"><span class="section-number-4">13.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-orge1dd0ca" class="outline-4">
<h4 id="orge1dd0ca"><span class="section-number-4">13.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org2d08092" class="outline-3">
<h3 id="org2d08092"><span class="section-number-3">13.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-13-6">
</div>
<div id="outline-container-org346dae6" class="outline-4">
<h4 id="org346dae6"><span class="section-number-4">13.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-org4e6964a" class="outline-4">
<h4 id="org4e6964a"><span class="section-number-4">13.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-orge481258" class="outline-4">
<h4 id="orge481258"><span class="section-number-4">13.6.3.</span> CPUs with async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-org92474bd" class="outline-4">
<h4 id="org92474bd"><span class="section-number-4">13.6.4.</span> Use Nucleo w/ 5V tolerant IO as boot loader controller</h4>
</div>
</div>
<div id="outline-container-org5520750" class="outline-3">
<h3 id="org5520750"><span class="section-number-3">13.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-13-7">
</div>
<div id="outline-container-org25f33ce" class="outline-4">
<h4 id="org25f33ce"><span class="section-number-4">13.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-13-7-1">
<p>
Unknown
</p>
</div>
</div>
<div id="outline-container-org497c448" class="outline-4">
<h4 id="org497c448"><span class="section-number-4">13.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-13-7-2">
<p>
Unknown
</p>
</div>
</div>
<div id="outline-container-orgc266c17" class="outline-4">
<h4 id="orgc266c17"><span class="section-number-4">13.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-13-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org2dc2d73" class="outline-4">
<h4 id="org2dc2d73"><span class="section-number-4">13.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-13-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
</p>
</div>
</div>
<div id="outline-container-org951f5c3" class="outline-4">
<h4 id="org951f5c3"><span class="section-number-4">13.7.5.</span> Etc.</h4>
</div>
</div>
</div>
<div id="outline-container-orgadad15f" class="outline-2">
<h2 id="orgadad15f"><span class="section-number-2">14.</span> David Davies</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgc685eff" class="outline-3">
<h3 id="orgc685eff"><span class="section-number-3">14.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgfe2c875" class="outline-3">
<h3 id="orgfe2c875"><span class="section-number-3">14.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org8ae736c" class="outline-3">
<h3 id="org8ae736c"><span class="section-number-3">14.3.</span> Next hearing 9/20/2022</h3>
</div>
</div>
<div id="outline-container-orgf82f0d0" class="outline-2">
<h2 id="orgf82f0d0"><span class="section-number-2">15.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orgb5c2a1b" class="outline-3">
<h3 id="orgb5c2a1b"><span class="section-number-3">15.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org15fd9b2" class="outline-3">
<h3 id="org15fd9b2"><span class="section-number-3">15.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-orgc214290" class="outline-3">
<h3 id="orgc214290"><span class="section-number-3">15.3.</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-org1b4c73f" class="outline-3">
<h3 id="org1b4c73f"><span class="section-number-3">15.4.</span> Sentencing 9/20/2022</h3>
</div>
<div id="outline-container-org1ef992b" class="outline-3">
<h3 id="org1ef992b"><span class="section-number-3">15.5.</span> See Also</h3>
<div class="outline-text-3" id="text-15-5">
<p>
<a href="https://www.theregister.com/2022/09/15/broadcom_engineer_ip_theft/">https://www.theregister.com/2022/09/15/broadcom_engineer_ip_theft/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org1cbda5c" class="outline-2">
<h2 id="org1cbda5c"><span class="section-number-2">16.</span> Reading</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org5cccb1d" class="outline-3">
<h3 id="org5cccb1d"><span class="section-number-3">16.1.</span> A New History of Modern Computing (Thomas Haigh and Paul E. Ceruzzi)</h3>
<div class="outline-text-3" id="text-16-1">
<p>
<a href="https://mitpress.mit.edu/9780262542906/a-new-history-of-modern-computing/">https://mitpress.mit.edu/9780262542906/a-new-history-of-modern-computing/</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-09-17 Sat 07:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
